int/resources/objectRepo/xmlTemplates/htng/HTNG2008BReservation/req_ReservationLookup.xml

<soapenv:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://htng.org/PWS/2008B/SingleGuestItinerary/Reservation/Types" xmlns:typ1="http://htng.org/PWS/2008B/SingleGuestItinerary/Common/Types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:ReservationLookupRequest>
         <ReservationLookupData otherReservationStatus="?" reservationStatus="?">
            <ReservationID source="?"/>
            <ProfileID source="?"/>
            <RoomNumber/>
            <DateRange>
               <typ1:Start/>
               <typ1:End/>
            </DateRange>
            <ProfileInfo familiarName="?" nameOrdered="?">
               <typ1:NameTitle/>
               <typ1:FirstName/>
               <typ1:MiddleName/>
               <typ1:LastName/>
               <typ1:NameSuffix/>
            </ProfileInfo>
            <ReservationAddress addressType="?" otherAddressType="?">
               <typ1:AddressLine/>
			    <typ1:AddressLine/>
				 <typ1:AddressLine/>
				  <typ1:AddressLine/>
               <typ1:CityName/>
               <typ1:StateProv/>
               <typ1:CountryCode/>
               <typ1:PostalCode/>
            </ReservationAddress>
            <MembershipID>
               <typ1:MembershipType/>
               <typ1:MembershipNumber/>
               <typ1:MembershipLevel/>
               <typ1:MemberName/>
               <typ1:EffectiveDate/>
               <typ1:ExpirationDate/>
               <typ1:CurrentPoints/>
            </MembershipID>
            <ConfirmationNo/>
            <ResortId/>
            <PhoneList>
               <typ1:Phone phoneRole="?" phoneType="?">
                  <typ1:PhoneNumber/>
                  <typ1:PhoneData>
                     <typ1:CountryAccessCode/>
                     <typ1:AreaCode/>
                     <typ1:PhoneNumber/>
                     <typ1:Extension/>
                  </typ1:PhoneData>
               </typ1:Phone>
            </PhoneList>
         </ReservationLookupData>
      </typ:ReservationLookupRequest>
   </soapenv:Body>
</soapenv:Envelope>